module.exports = [{
  id: 1,
  type: "平台研发部",
  salary:"10-15K",
  year:"2-3年/本科",
  job: "资深JAVA架构师",
  time: "2018-05-01",
  duty: [
    "1、 按需求进行业务需求分析和软件概要设计；",
    "2、 负责平台的方案、架构设计，主导或参与汽车金融相关业务系统的服务化架构与改造；",
    "3、 主导技术难题攻关，持续提升核心系统在高并发、海量请求下的处理性能，带团队解决高并发、高可靠性等各种技术问题；",
    "4、 复杂分布式系统的设计、用先进可靠的技术架构支撑公司业务的快速发展。",
  ],
  ask: [
    "1、 要求本科以上学历，5-10年Java软件开发项目工作经验；",
    "2、 精通Tomcat、Apache、Nginx等多种开源服务器，熟练掌握至少2种应用服务器，如WebLogic、Tomcat、Resin、JBoss、WebSphere等；",
    "3、 熟练掌握J2EE体系架构；",
    "4、 熟练掌握 Struts、Hibernate、Spring、SpringMVC、Springboot、Spring Cloud、Dubbo、MyBatis等开源框架并了解工作原理；",
    "5、 熟悉IO、多线程、集合等基础框架，熟悉分布式、缓存、消息、搜索等机制。 熟悉web service理念，有相关设计、开发经验者优先；",
    "6、 熟悉Web 前端开发，掌握HTML5、CSS3、JavaScript/Ajax、jQuery等主要技术；",
    "7、 熟悉JVM内存管理、类加载机制等，掌握Java系统的故障排查和性能调优；",
    "8、 熟练掌握Oracle、MySQL等主流数据库，熟悉数据库建模，具备深厚的SQL功底，并有着丰富的数据库设计经验，了解Mongo DB，NOSQL的数据存储产品，熟悉不同类型和数据库的底层运行原理和优缺点；",
    "9、 具有系统需求分析和设计能力，能快速理解业务需求并进行相关逻辑设计，熟悉UML建模，并熟练使用相关建模工具，并具有规范的开发、设计文档写作能力；",
    "10、 熟悉缓存技术，应用优化，服务器优化，集群技术处理、应用负载均衡、系统性能调优等技术，具有高并发平台开发经验优先；",
    "11、 熟悉主流的SaaS平台技术,具有一个以上SaaS平台开发的实际工作经验，并具有丰富高并发、高吞吐、高稳定性系统架构设计与实现经验，对架构重构分析、分步改进有实战经验；",
    "12、有汽车金融行业经验优先。"
  ]
}, {
  id: 2,
  type: "平台研发部",
  salary:"15-20K",
  year:"5年/本科",
  job: "JAVA高级开发工程师",
  time: "2018-05-02",
  duty: [
    "1、承担核心功能代码编写，项目架构设计开发；",
    "2、开发和维护统一的软件开发架构，应对海量数据与高并发，并能及时发现和解决存在的技术问题；",
    "3、新人指导、培训及Code Review，主导技术难题攻关，提升团队整体技术水平。"
  ],
  ask: [
    "1、精通Java语言相关技能（设计模式，JVM，JDK新特性，多线程等）；",
    "2、熟练使用SpringMvc、Mybatis、redis、zookeeper、dubbo、SpringCloud、 SpringBoot等技术；",
    "3、 熟悉Linux操作系统，熟练掌握Mysql等主流数据库，熟练使用SQL，常规性能优化，有海量数据平台开发经验者优先；",
    "4、 良好的沟通表达能力与团队合作精神，强烈的责任心和较强的学习能力；",
    "5、有汽车金融行业经验者优先。"
  ]
}, {
  id: 3,
  type: "平台研发部",
  salary:"15-20K",
  year:"5年/本科",
  job: "JAVA中级开发工程师",
  time: "2018-05-03",
  duty: [
    "1、 参与软件产品的需求分析、概要设计、编码等工作；",
    "2、负责主要功能和代码的编写；",
    "3、 负责内外部接口的整理和开发工作。"
  ],
  ask: [
    "1、 计算机或相关专业本科以上学历，2年以上的JAVA开发经验；",
    "2、精通java，基本功扎实，掌握面向对象设计和开发技术，了解设计模式，拥有良好的编码规范；",
    "3、 熟练使用主流开源框架，Spring MVC，MyBatis，Shiro，Dubbo、SpringCloud、SpringBoot等常用框架；",
    "4、 熟练使用Tomcat、Jetty、Nginx等多种应用和WEB服务器；",
    "5、 熟练使用并且有过使用RabbitMQ，Redis，Zookeeper等应用，有过分布式架构工作经验者优先；",
    "6、 熟练使用常见关系型数据库，如MySQL、Oracle等，能对复杂SQL进行性能优化；",
    "7、 熟练使用多线程及并发技术；",
    "8、 熟练使用Maven的使用，理解Maven的原理与使用技巧；",
    "9、 工作主动性强，耐心细致，有责任心；能承受一定压力，有良好的沟通能力与团队合作精神；",
    "10、 有汽车金融行业优先,有大数据处理和高并发性能解决方和数据安全解决方案优先。"
  ]
}
];
